vbuzyan/Esp32-p4/boards/crowpanel_advanced_9inch_p4/sdkconfig.defaults
# sdkconfig.defaults — starter overlay for GhostESP on the CrowPanel 9" ESP32-P4
# ============================================================================
# This is a SEED, not a finished config. It lists the meaningful options a human
# sets; the hundreds of autogenerated CONFIG_SOC_* values come from ESP-IDF when
# you run `idf.py set-target esp32p4`. Workflow:
#
#   cp boards/crowpanel_advanced_9inch_p4/sdkconfig.defaults <ghostesp>/sdkconfig.defaults
#   idf.py set-target esp32p4
#   idf.py menuconfig        # fill in display timings, pins, features
#   # ...build/test on hardware, then save back to configs/sdkconfig.crowpanel_p4_9inch
#
# NOTHING HERE HAS BEEN BUILT. Every value is proposed and must be verified on
# real ESP-IDF v6.0 + hardware. See ../../docs/PORTING.md.
# ============================================================================

# --- Target -----------------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# --- Board identity (GhostESP) ----------------------------------------------
CONFIG_BUILD_CONFIG_TEMPLATE="crowpanel_p4_9inch"

# --- PSRAM (needed for the 1024x600 framebuffer and native SD apps) ---------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# --- Display: 1024x600 MIPI-DSI, ILI9881C-class -----------------------------
# GhostESP does not yet have a wired-up DSI flush path; see PORTING.md §4.
# These express intent; the actual DSI init/timings are done in code + IDF's
# esp_lcd_mipi_dsi, not purely via Kconfig.
CONFIG_WITH_SCREEN=y
CONFIG_TFT_WIDTH=1024
CONFIG_TFT_HEIGHT=600
# TODO: add/select a DSI display-controller option once the driver is wired in.

# --- Touch: GT911 (I2C). Set pins to match pins.h / schematic ---------------
# TODO: enable GhostESP's GT911 touch option and set SCL=46 SDA=45 INT=42 RST=?

# --- GhostLink: relay to the added WiFi module (recommended radio path) ------
# Enable the two-device UART link; choose TX/RX GPIOs that don't collide with
# DSI/touch/SD/audio (GhostESP default 6/7 collide with the module-bay SPI on
# this board). Pins are also settable at runtime via `commsetpins`.
# TODO: set GhostLink UART TX/RX pins to your chosen free GPIOs.

# --- Onboard-C6 WiFi via esp-hosted: OPTIONAL (Phase 3, PORTING.md §5) -------
# Leave OFF for the pure display+relay build. Turn on only to give the P4 its
# own station/AP + WebUI through the onboard C6 (normal hosted path, no custom
# RPC). Requires esp_wifi_remote/esp_hosted in idf_component.yml.

# --- Logging / console ------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
